In [1]:
import pandas as pd

In [17]:
dataset =pd.read_csv(r"E:\tops\Data science\practical\loan.csv")
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [3]:
dataset.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [10]:
dataset.select_dtypes(include=["float64","int64"]).columns

Index(['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History'],
      dtype='object')

# mode through null value fill

In [12]:
for i in dataset.select_dtypes(include=["float64","int64"]).columns:    #more use  value show
    print(i,"=",dataset[i].mode()[0])

ApplicantIncome = 2500
CoapplicantIncome = 0.0
LoanAmount = 120.0
Loan_Amount_Term = 360.0
Credit_History = 1.0

In [15]:
for i in dataset.select_dtypes(include=["float64","int64"]).columns:            #all columns numarical null value fill
    dataset[i]=dataset[i].fillna(dataset[i].mode()[0])

In [16]:
dataset.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Credit_History        0
Property_Area         0
Loan_Status           0
dtype: int64

# scikit Learn through null value fill

In [19]:
from sklearn.impute import SimpleImputer

In [21]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [22]:
dataset.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [38]:
num_columns=dataset.select_dtypes(include=["float","int64"])

In [39]:
si =SimpleImputer(strategy="mean")
ar=si.fit_transform(num_columns)

In [41]:
new_dataset=pd.DataFrame(ar,columns=num_columns.columns)
new_dataset.isnull().sum()

ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
dtype: int64

In [45]:
num_columns,ar

(     ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
 0               5849                0.0         NaN             360.0
 1               4583             1508.0       128.0             360.0
 2               3000                0.0        66.0             360.0
 3               2583             2358.0       120.0             360.0
 4               6000                0.0       141.0             360.0
 ..               ...                ...         ...               ...
 609             2900                0.0        71.0             360.0
 610             4106                0.0        40.0             180.0
 611             8072              240.0       253.0             360.0
 612             7583                0.0       187.0             360.0
 613             4583                0.0       133.0             360.0

      Credit_History
 0               1.0
 1               1.0
 2               1.0
 3               1.0
 4               1.0
 ..              ...
 609             1.0
 610             1.0
 611             1.0
 612             1.0
 613             0.0

 [614 rows x 5 columns],
 array([[5.84900000e+03, 0.00000000e+00, 1.46412162e+02, 3.60000000e+02,
         1.00000000e+00],
        [4.58300000e+03, 1.50800000e+03, 1.28000000e+02, 3.60000000e+02,
         1.00000000e+00],
        [3.00000000e+03, 0.00000000e+00, 6.60000000e+01, 3.60000000e+02,
         1.00000000e+00],
        ...,
        [8.07200000e+03, 2.40000000e+02, 2.53000000e+02, 3.60000000e+02,
         1.00000000e+00],
        [7.58300000e+03, 0.00000000e+00, 1.87000000e+02, 3.60000000e+02,
         1.00000000e+00],
        [4.58300000e+03, 0.00000000e+00, 1.33000000e+02, 3.60000000e+02,
         0.00000000e+00]]))

In [49]:
dataset[list(num_columns)]=pd.DataFrame(ar,columns=list(num_columns),index=dataset.index)

In [51]:
dataset.notnull().sum()

Loan_ID              614
Gender               601
Married              611
Dependents           599
Education            614
Self_Employed        582
ApplicantIncome      614
CoapplicantIncome    614
LoanAmount           614
Loan_Amount_Term     614
Credit_History       614
Property_Area        614
Loan_Status          614
dtype: int64

In [52]:
dataset.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849.0,0.0,146.412162,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583.0,1508.0,128.000000,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000.0,0.0,66.000000,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583.0,2358.0,120.000000,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000.0,0.0,141.000000,360.0,1.0,Urban,Y